set_input_delay -clock [get_clocks sysClk] -min -add_delay 1.800 [get_ports {adc0[*]}]
set_input_delay -clock [get_clocks sysClk] -max -add_delay 5.400 [get_ports {adc0[*]}]
set_input_delay -clock [get_clocks sysClk] -min -add_delay 1.800 [get_ports {adc1[*]}]
set_input_delay -clock [get_clocks sysClk] -max -add_delay 5.400 [get_ports {adc1[*]}]
set_input_delay -clock [get_clocks fbClk] -min -add_delay 0.500 [get_ports {fb_addr[*]}]
set_input_delay -clock [get_clocks fbClk] -max -add_delay 13.500 [get_ports {fb_addr[*]}]
set_input_delay -clock [get_clocks fbClk] -min -add_delay 0.500 [get_ports fb_ale]
set_input_delay -clock [get_clocks fbClk] -max -add_delay 13.500 [get_ports fb_ale]

set_input_delay -clock [get_clocks fbClk] -min -add_delay 0.500 [get_ports fb_csn]
set_input_delay -clock [get_clocks fbClk] -max -add_delay 13.500 [get_ports fb_csn]
set_input_delay -clock [get_clocks fbClk] -min -add_delay 0.500 [get_ports fb_wrn]
set_input_delay -clock [get_clocks fbClk] -max -add_delay 13.500 [get_ports fb_wrn]
set_output_delay -clock [get_clocks sysClk] -min -add_delay -0.100 [get_ports {dac0_d[*]}]
set_output_delay -clock [get_clocks sysClk] -max -add_delay 3.400 [get_ports {dac0_d[*]}]
set_output_delay -clock [get_clocks sysClk] -min -add_delay -0.100 [get_ports {dac1_d[*]}]
set_output_delay -clock [get_clocks sysClk] -max -add_delay 3.400 [get_ports {dac1_d[*]}]
set_output_delay -clock [get_clocks sysClk] -min -add_delay -0.100 [get_ports {dac2_d[*]}]
set_output_delay -clock [get_clocks sysClk] -max -add_delay 3.400 [get_ports {dac2_d[*]}]
set_output_delay -clock [get_clocks fbClk] -min -add_delay -0.500 [get_ports {fb_data[*]}]
set_output_delay -clock [get_clocks fbClk] -max -add_delay 15.500 [get_ports {fb_data[*]}]
create_clock -period 32.000 -name virtual_clock
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports fb_oen]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports fb_oen]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {fb_data[0]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {fb_data[0]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {fb_data[1]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {fb_data[1]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {fb_data[2]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {fb_data[2]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {fb_data[3]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {fb_data[3]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {fb_data[4]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {fb_data[4]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {fb_data[5]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {fb_data[5]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {fb_data[6]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {fb_data[6]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {fb_data[7]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {fb_data[7]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {fb_data[8]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {fb_data[8]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {fb_data[9]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {fb_data[9]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {fb_data[10]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {fb_data[10]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {fb_data[11]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {fb_data[11]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {fb_data[12]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {fb_data[12]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {fb_data[13]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {fb_data[13]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {fb_data[14]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {fb_data[14]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {fb_data[15]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {fb_data[15]}]

set_clock_groups -asynchronous \
	-group [get_clocks -include_generated_clocks fbClk] \
	-group [get_clocks -include_generated_clocks sysClk]

set_output_delay -clock [get_clocks sysClk] -min -add_delay -2.000 [get_ports bsClkOut]
set_output_delay -clock [get_clocks sysClk] -max -add_delay 4.000  [get_ports bsClkOut]
set_output_delay -clock [get_clocks sysClk] -min -add_delay -2.000 [get_ports bsDataOut]
set_output_delay -clock [get_clocks sysClk] -max -add_delay 4.000  [get_ports bsDataOut]
set_output_delay -clock [get_clocks sysClk] -min -add_delay -2.000 [get_ports bsDiffClkOut]
set_output_delay -clock [get_clocks sysClk] -max -add_delay 4.000  [get_ports bsDiffClkOut]
set_output_delay -clock [get_clocks sysClk] -min -add_delay -2.000 [get_ports bsDiffDataOut]
set_output_delay -clock [get_clocks sysClk] -max -add_delay 4.000  [get_ports bsDiffDataOut]
set_output_delay -clock [get_clocks sysClk] -min -add_delay -2.000 [get_ports encClkOut]
set_output_delay -clock [get_clocks sysClk] -max -add_delay 4.000  [get_ports encClkOut]
set_output_delay -clock [get_clocks sysClk] -min -add_delay -2.000 [get_ports encDataOut]
set_output_delay -clock [get_clocks sysClk] -max -add_delay 4.000  [get_ports encDataOut]
set_output_delay -clock [get_clocks sysClk] -min -add_delay -2.000 [get_ports fsClkOut]
set_output_delay -clock [get_clocks sysClk] -max -add_delay 4.000  [get_ports fsClkOut]
set_output_delay -clock [get_clocks sysClk] -min -add_delay -2.000 [get_ports fsDataOut]
set_output_delay -clock [get_clocks sysClk] -max -add_delay 4.000  [get_ports fsDataOut]
set_output_delay -clock [get_clocks sysClk] -min -add_delay -2.000 [get_ports fsDiffClkOut]
set_output_delay -clock [get_clocks sysClk] -max -add_delay 4.000  [get_ports fsDiffClkOut]
set_output_delay -clock [get_clocks sysClk] -min -add_delay -2.000 [get_ports fsDiffDataOut]
set_output_delay -clock [get_clocks sysClk] -max -add_delay 4.000  [get_ports fsDiffDataOut]

set_false_path -from [all_registers] -to [get_ports fb_data*]
set_false_path -from [get_ports fb_oen*] -to [get_ports fb_data*]
set_false_path -from [get_clocks fbClk] -to [get_ports bsClkOut]    
set_false_path -from [get_clocks fbClk] -to [get_ports bsDataOut]   
set_false_path -from [get_clocks fbClk] -to [get_ports bsDiffClkOut]
set_false_path -from [get_clocks fbClk] -to [get_ports bsDiffDataOut]
set_false_path -from [get_clocks fbClk] -to [get_ports encClkOut]   
set_false_path -from [get_clocks fbClk] -to [get_ports encDataOut]  
set_false_path -from [get_clocks fbClk] -to [get_ports fsClkOut]    
set_false_path -from [get_clocks fbClk] -to [get_ports fsDataOut]   
set_false_path -from [get_clocks fbClk] -to [get_ports fsDiffClkOut]
set_false_path -from [get_clocks fbClk] -to [get_ports fsDiffDataOut]
set_false_path -from [get_clocks sysClk] -to [get_ports ch0Lockn]
set_false_path -from [get_clocks sysClk] -to [get_ports ch1Lockn]

