create_clock -period 5.357 -name clk -waveform {0.000 2.678} [get_nets clk]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.500 [get_ports {deltaTauEst[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.000 [get_ports {deltaTauEst[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.500 [get_ports {h0EstImag[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.000 [get_ports {h0EstImag[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.500 [get_ports {h0EstReal[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.000 [get_ports {h0EstReal[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.500 [get_ports {h1EstImag[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.000 [get_ports {h1EstImag[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.500 [get_ports {h1EstReal[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.000 [get_ports {h1EstReal[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.500 [get_ports {in0Imag[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.000 [get_ports {in0Imag[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.500 [get_ports {in0Real[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.000 [get_ports {in0Real[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.500 [get_ports {in1Imag[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.000 [get_ports {in1Imag[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.500 [get_ports {in1Real[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.000 [get_ports {in1Real[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.500 [get_ports clkEn]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.000 [get_ports clkEn]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.500 [get_ports reset]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.000 [get_ports reset]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.500 [get_ports sampleEn]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.000 [get_ports sampleEn]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.500 [get_ports startFrame]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.000 [get_ports startFrame]
set_false_path -from [get_pins -hierarchical -filter { NAME =~  "*stageSetup0/*/C" }] -to [get_pins -hierarchical -filter { NAME =~  "*stage0*/acs*/cmag/*/inferred_dsp*/*" }]
set_false_path -from [get_pins -hierarchical -filter { NAME =~  "*stageSetup1/*/C" }] -to [get_pins -hierarchical -filter { NAME =~  "*stage1*/acs*/cmag/*/inferred_dsp*/*" }]
set_false_path -from [get_pins -hierarchical -filter { NAME =~  "*stageSetup2/*/C" }] -to [get_pins -hierarchical -filter { NAME =~  "*stage2*/acs*/cmag/*/inferred_dsp*/*" }]
set_false_path -from [get_pins -hierarchical -filter { NAME =~  "*stageSetup3/*/C" }] -to [get_pins -hierarchical -filter { NAME =~  "*stage3*/acs*/cmag/*/inferred_dsp*/*" }]
set_false_path -from [get_pins -hierarchical -filter { NAME =~  "*stageSetup4/*/C" }] -to [get_pins -hierarchical -filter { NAME =~  "*stage4*/acs*/cmag/*/inferred_dsp*/*" }]
set_false_path -from [get_pins -hierarchical -filter { NAME =~  "*stageSetup5/*/C" }] -to [get_pins -hierarchical -filter { NAME =~  "*stage5*/acs*/cmag/*/inferred_dsp*/*" }]
set_false_path -from [get_pins -hierarchical -filter { NAME =~  "*stageSetup6/*/C" }] -to [get_pins -hierarchical -filter { NAME =~  "*stage6*/acs*/cmag/*/inferred_dsp*/*" }]
set_false_path -from [get_pins -hierarchical -filter { NAME =~  "*stageSetup7/*/C" }] -to [get_pins -hierarchical -filter { NAME =~  "*stage7*/acs*/cmag/*/inferred_dsp*/*" }]
set_false_path -from [get_pins -hierarchical -filter { NAME =~  "*stage0*/wrAddr*/C" }] -to [get_pins -hierarchical -filter { NAME =~  "*stage0*/acs*/cmag/*/inferred_dsp*/*" }]
set_false_path -from [get_pins -hierarchical -filter { NAME =~  "*stage1*/wrAddr*/C" }] -to [get_pins -hierarchical -filter { NAME =~  "*stage1*/acs*/cmag/*/inferred_dsp*/*" }]
set_false_path -from [get_pins -hierarchical -filter { NAME =~  "*stage2*/wrAddr*/C" }] -to [get_pins -hierarchical -filter { NAME =~  "*stage2*/acs*/cmag/*/inferred_dsp*/*" }]
set_false_path -from [get_pins -hierarchical -filter { NAME =~  "*stage3*/wrAddr*/C" }] -to [get_pins -hierarchical -filter { NAME =~  "*stage3*/acs*/cmag/*/inferred_dsp*/*" }]
set_false_path -from [get_pins -hierarchical -filter { NAME =~  "*stage4*/wrAddr*/C" }] -to [get_pins -hierarchical -filter { NAME =~  "*stage4*/acs*/cmag/*/inferred_dsp*/*" }]
set_false_path -from [get_pins -hierarchical -filter { NAME =~  "*stage5*/wrAddr*/C" }] -to [get_pins -hierarchical -filter { NAME =~  "*stage5*/acs*/cmag/*/inferred_dsp*/*" }]
set_false_path -from [get_pins -hierarchical -filter { NAME =~  "*stage6*/wrAddr*/C" }] -to [get_pins -hierarchical -filter { NAME =~  "*stage6*/acs*/cmag/*/inferred_dsp*/*" }]
set_false_path -from [get_pins -hierarchical -filter { NAME =~  "*stage7*/wrAddr*/C" }] -to [get_pins -hierarchical -filter { NAME =~  "*stage7*/acs*/cmag/*/inferred_dsp*/*" }]
set_false_path -from [get_ports reset] -to [all_registers]

