create_clock -period 21.459 -name {ClkIn[0]} -waveform {0.000 10.730} [get_ports {ClkIn_p[0]}]
create_clock -period 21.459 -name {ClkIn[1]} -waveform {0.000 10.730} [get_ports {ClkIn_p[1]}]
create_clock -period 21.459 -name {ClkIn[2]} -waveform {0.000 10.730} [get_ports {ClkIn_p[2]}]
create_clock -period 21.459 -name {ClkIn[3]} -waveform {0.000 10.730} [get_ports {ClkIn_p[3]}]
create_clock -period 21.459 -name {ClkIn[4]} -waveform {0.000 10.730} [get_ports {ClkIn_p[4]}]
create_clock -period 21.459 -name {ClkIn[5]} -waveform {0.000 10.730} [get_ports {ClkIn_p[5]}]
create_clock -period 21.459 -name {ClkIn[6]} -waveform {0.000 10.730} [get_ports {ClkIn_p[6]}]
create_clock -period 21.459 -name {ClkIn[7]} -waveform {0.000 10.730} [get_ports {ClkIn_p[7]}]
create_clock -period 21.459 -name {ClkIn[8]} -waveform {0.000 10.730} [get_ports {ClkIn_p[8]}]
create_clock -period 21.459 -name {ClkIn[9]} -waveform {0.000 10.730} [get_ports {ClkIn_p[9]}]
create_clock -period 21.459 -name {ClkIn[10]} -waveform {0.000 10.730} [get_ports {ClkIn_p[10]}]
create_clock -period 21.459 -name {ClkIn[11]} -waveform {0.000 10.730} [get_ports {ClkIn_p[11]}]
create_clock -period 21.459 -name {ClkIn[12]} -waveform {0.000 10.730} [get_ports {ClkIn_p[12]}]
create_clock -period 21.459 -name {ClkIn[13]} -waveform {0.000 10.730} [get_ports {ClkIn_p[13]}]
create_clock -period 21.459 -name {ClkIn[14]} -waveform {0.000 10.730} [get_ports {ClkIn_p[14]}]
create_clock -period 21.459 -name {ClkIn[15]} -waveform {0.000 10.730} [get_ports {ClkIn_p[15]}]
create_clock -period 21.459 -name {ClkIn[16]} -waveform {0.000 10.730} [get_ports {ClkIn_p[16]}]
create_clock -period 21.459 -name {ClkIn[17]} -waveform {0.000 10.730} [get_ports {ClkIn_p[17]}]
create_clock -period 21.459 -name {ClkIn[18]} -waveform {0.000 10.730} [get_ports {ClkIn_p[18]}]
create_clock -period 21.459 -name {ClkIn[19]} -waveform {0.000 10.730} [get_ports {ClkIn_p[19]}]
create_clock -period 21.459 -name {ClkIn[20]} -waveform {0.000 10.730} [get_ports {ClkIn_p[20]}]
create_clock -period 21.459 -name {ClkIn[21]} -waveform {0.000 10.730} [get_ports {ClkIn_p[21]}]
create_clock -period 21.459 -name {ClkIn[22]} -waveform {0.000 10.730} [get_ports {ClkIn_p[22]}]
create_clock -period 21.459 -name {ClkIn[23]} -waveform {0.000 10.730} [get_ports {ClkIn_p[23]}]

create_clock -period 10.714 -name Clk93 -waveform {0.000 5.357} [get_ports Clk93_p]
set_false_path -from [get_ports *Rxd*] -to [get_clocks Clk93]
set_false_path -from [get_clocks Clk93] -to [get_ports *Txd*]

create_clock -period 21.459 -name {ClkOut[0]} -waveform {0.000 10.730} [get_ports {ClkOut[0]}]
create_clock -period 21.459 -name {ClkOut[1]} -waveform {0.000 10.730} [get_ports {ClkOut[1]}]
create_clock -period 21.459 -name {ClkOut[2]} -waveform {0.000 10.730} [get_ports {ClkOut[2]}]
create_clock -period 21.459 -name {ClkOut[3]} -waveform {0.000 10.730} [get_ports {ClkOut[3]}]
create_clock -period 21.459 -name {ClkOut[4]} -waveform {0.000 10.730} [get_ports {ClkOut[4]}]
create_clock -period 21.459 -name {ClkOut[5]} -waveform {0.000 10.730} [get_ports {ClkOut[5]}]
create_clock -period 21.459 -name {ClkOut[6]} -waveform {0.000 10.730} [get_ports {ClkOut[6]}]
create_clock -period 21.459 -name {ClkOut[7]} -waveform {0.000 10.730} [get_ports {ClkOut[7]}]
create_clock -period 21.459 -name {ClkOut[8]} -waveform {0.000 10.730} [get_ports {ClkOut[8]}]
create_clock -period 21.459 -name {ClkOut[9]} -waveform {0.000 10.730} [get_ports {ClkOut[9]}]
create_clock -period 21.459 -name {ClkOut[10]} -waveform {0.000 10.730} [get_ports {ClkOut[10]}]
create_clock -period 21.459 -name {ClkOut[11]} -waveform {0.000 10.730} [get_ports {ClkOut[11]}]
create_clock -period 21.459 -name {ClkOut[12]} -waveform {0.000 10.730} [get_ports {ClkOut[12]}]
create_clock -period 21.459 -name {ClkOut[13]} -waveform {0.000 10.730} [get_ports {ClkOut[13]}]
create_clock -period 21.459 -name {ClkOut[14]} -waveform {0.000 10.730} [get_ports {ClkOut[14]}]
create_clock -period 21.459 -name {ClkOut[15]} -waveform {0.000 10.730} [get_ports {ClkOut[15]}]

set_input_delay -clock [get_clocks {ClkIn[0]}] -min -add_delay 1.000 [get_ports {{DataIn_p[0]} {DataIn_n[0]}}]
set_input_delay -clock [get_clocks {ClkIn[0]}] -max -add_delay 2.000 [get_ports {{DataIn_p[0]} {DataIn_n[0]}}]
set_input_delay -clock [get_clocks {ClkIn[1]}] -min -add_delay 1.000 [get_ports {{DataIn_p[1]} {DataIn_n[1]}}]
set_input_delay -clock [get_clocks {ClkIn[1]}] -max -add_delay 2.000 [get_ports {{DataIn_p[1]} {DataIn_n[1]}}]
set_input_delay -clock [get_clocks {ClkIn[2]}] -min -add_delay 1.000 [get_ports {{DataIn_p[2]} {DataIn_n[2]}}]
set_input_delay -clock [get_clocks {ClkIn[2]}] -max -add_delay 2.000 [get_ports {{DataIn_p[2]} {DataIn_n[2]}}]
set_input_delay -clock [get_clocks {ClkIn[3]}] -min -add_delay 1.000 [get_ports {{DataIn_p[3]} {DataIn_n[3]}}]
set_input_delay -clock [get_clocks {ClkIn[3]}] -max -add_delay 2.000 [get_ports {{DataIn_p[3]} {DataIn_n[3]}}]
set_input_delay -clock [get_clocks {ClkIn[4]}] -min -add_delay 1.000 [get_ports {{DataIn_p[4]} {DataIn_n[4]}}]
set_input_delay -clock [get_clocks {ClkIn[4]}] -max -add_delay 2.000 [get_ports {{DataIn_p[4]} {DataIn_n[4]}}]
set_input_delay -clock [get_clocks {ClkIn[5]}] -min -add_delay 1.000 [get_ports {{DataIn_p[5]} {DataIn_n[5]}}]
set_input_delay -clock [get_clocks {ClkIn[5]}] -max -add_delay 2.000 [get_ports {{DataIn_p[5]} {DataIn_n[5]}}]
set_input_delay -clock [get_clocks {ClkIn[6]}] -min -add_delay 1.000 [get_ports {{DataIn_p[6]} {DataIn_n[6]}}]
set_input_delay -clock [get_clocks {ClkIn[6]}] -max -add_delay 2.000 [get_ports {{DataIn_p[6]} {DataIn_n[6]}}]
set_input_delay -clock [get_clocks {ClkIn[7]}] -min -add_delay 1.000 [get_ports {{DataIn_p[7]} {DataIn_n[7]}}]
set_input_delay -clock [get_clocks {ClkIn[7]}] -max -add_delay 2.000 [get_ports {{DataIn_p[7]} {DataIn_n[7]}}]
set_input_delay -clock [get_clocks {ClkIn[8]}] -min -add_delay 1.000 [get_ports {{DataIn_p[8]} {DataIn_n[8]}}]
set_input_delay -clock [get_clocks {ClkIn[8]}] -max -add_delay 2.000 [get_ports {{DataIn_p[8]} {DataIn_n[8]}}]
set_input_delay -clock [get_clocks {ClkIn[9]}] -min -add_delay 1.000 [get_ports {{DataIn_p[9]} {DataIn_n[9]}}]
set_input_delay -clock [get_clocks {ClkIn[9]}] -max -add_delay 2.000 [get_ports {{DataIn_p[9]} {DataIn_n[9]}}]
set_input_delay -clock [get_clocks {ClkIn[10]}] -min -add_delay 1.000 [get_ports {{DataIn_p[10]} {DataIn_n[10]}}]
set_input_delay -clock [get_clocks {ClkIn[10]}] -max -add_delay 2.000 [get_ports {{DataIn_p[10]} {DataIn_n[10]}}]
set_input_delay -clock [get_clocks {ClkIn[11]}] -min -add_delay 1.000 [get_ports {{DataIn_p[11]} {DataIn_n[11]}}]
set_input_delay -clock [get_clocks {ClkIn[11]}] -max -add_delay 2.000 [get_ports {{DataIn_p[11]} {DataIn_n[11]}}]
set_input_delay -clock [get_clocks {ClkIn[12]}] -min -add_delay 1.000 [get_ports {{DataIn_p[12]} {DataIn_n[12]}}]
set_input_delay -clock [get_clocks {ClkIn[12]}] -max -add_delay 2.000 [get_ports {{DataIn_p[12]} {DataIn_n[12]}}]
set_input_delay -clock [get_clocks {ClkIn[13]}] -min -add_delay 1.000 [get_ports {{DataIn_p[13]} {DataIn_n[13]}}]
set_input_delay -clock [get_clocks {ClkIn[13]}] -max -add_delay 2.000 [get_ports {{DataIn_p[13]} {DataIn_n[13]}}]
set_input_delay -clock [get_clocks {ClkIn[14]}] -min -add_delay 1.000 [get_ports {{DataIn_p[14]} {DataIn_n[14]}}]
set_input_delay -clock [get_clocks {ClkIn[14]}] -max -add_delay 2.000 [get_ports {{DataIn_p[14]} {DataIn_n[14]}}]
set_input_delay -clock [get_clocks {ClkIn[15]}] -min -add_delay 1.000 [get_ports {{DataIn_p[15]} {DataIn_n[15]}}]
set_input_delay -clock [get_clocks {ClkIn[15]}] -max -add_delay 2.000 [get_ports {{DataIn_p[15]} {DataIn_n[15]}}]
set_input_delay -clock [get_clocks {ClkIn[16]}] -min -add_delay 1.000 [get_ports {{DataIn_p[16]} {DataIn_n[16]}}]
set_input_delay -clock [get_clocks {ClkIn[16]}] -max -add_delay 2.000 [get_ports {{DataIn_p[16]} {DataIn_n[16]}}]
set_input_delay -clock [get_clocks {ClkIn[17]}] -min -add_delay 1.000 [get_ports {{DataIn_p[17]} {DataIn_n[17]}}]
set_input_delay -clock [get_clocks {ClkIn[17]}] -max -add_delay 2.000 [get_ports {{DataIn_p[17]} {DataIn_n[17]}}]
set_input_delay -clock [get_clocks {ClkIn[18]}] -min -add_delay 1.000 [get_ports {{DataIn_p[18]} {DataIn_n[18]}}]
set_input_delay -clock [get_clocks {ClkIn[18]}] -max -add_delay 2.000 [get_ports {{DataIn_p[18]} {DataIn_n[18]}}]
set_input_delay -clock [get_clocks {ClkIn[19]}] -min -add_delay 1.000 [get_ports {{DataIn_p[19]} {DataIn_n[19]}}]
set_input_delay -clock [get_clocks {ClkIn[19]}] -max -add_delay 2.000 [get_ports {{DataIn_p[19]} {DataIn_n[19]}}]
set_input_delay -clock [get_clocks {ClkIn[20]}] -min -add_delay 1.000 [get_ports {{DataIn_p[20]} {DataIn_n[20]}}]
set_input_delay -clock [get_clocks {ClkIn[20]}] -max -add_delay 2.000 [get_ports {{DataIn_p[20]} {DataIn_n[20]}}]
set_input_delay -clock [get_clocks {ClkIn[21]}] -min -add_delay 1.000 [get_ports {{DataIn_p[21]} {DataIn_n[21]}}]
set_input_delay -clock [get_clocks {ClkIn[21]}] -max -add_delay 2.000 [get_ports {{DataIn_p[21]} {DataIn_n[21]}}]
set_input_delay -clock [get_clocks {ClkIn[22]}] -min -add_delay 1.000 [get_ports {{DataIn_p[22]} {DataIn_n[22]}}]
set_input_delay -clock [get_clocks {ClkIn[22]}] -max -add_delay 2.000 [get_ports {{DataIn_p[22]} {DataIn_n[22]}}]
set_input_delay -clock [get_clocks {ClkIn[23]}] -min -add_delay 1.000 [get_ports {{DataIn_p[23]} {DataIn_n[23]}}]
set_input_delay -clock [get_clocks {ClkIn[23]}] -max -add_delay 2.000 [get_ports {{DataIn_p[23]} {DataIn_n[23]}}]

set_output_delay -clock [get_clocks {ClkOut[0]}] -min -add_delay 1.000 [get_ports {DataOut[0]}]
set_output_delay -clock [get_clocks {ClkOut[0]}] -max -add_delay 1.000 [get_ports {DataOut[0]}]
set_output_delay -clock [get_clocks {ClkOut[1]}] -min -add_delay 1.000 [get_ports {DataOut[1]}]
set_output_delay -clock [get_clocks {ClkOut[1]}] -max -add_delay 1.000 [get_ports {DataOut[1]}]
set_output_delay -clock [get_clocks {ClkOut[2]}] -min -add_delay 1.000 [get_ports {DataOut[2]}]
set_output_delay -clock [get_clocks {ClkOut[2]}] -max -add_delay 1.000 [get_ports {DataOut[2]}]
set_output_delay -clock [get_clocks {ClkOut[3]}] -min -add_delay 1.000 [get_ports {DataOut[3]}]
set_output_delay -clock [get_clocks {ClkOut[3]}] -max -add_delay 1.000 [get_ports {DataOut[3]}]
set_output_delay -clock [get_clocks {ClkOut[4]}] -min -add_delay 1.000 [get_ports {DataOut[4]}]
set_output_delay -clock [get_clocks {ClkOut[4]}] -max -add_delay 1.000 [get_ports {DataOut[4]}]
set_output_delay -clock [get_clocks {ClkOut[5]}] -min -add_delay 1.000 [get_ports {DataOut[5]}]
set_output_delay -clock [get_clocks {ClkOut[5]}] -max -add_delay 1.000 [get_ports {DataOut[5]}]
set_output_delay -clock [get_clocks {ClkOut[6]}] -min -add_delay 1.000 [get_ports {DataOut[6]}]
set_output_delay -clock [get_clocks {ClkOut[6]}] -max -add_delay 1.000 [get_ports {DataOut[6]}]
set_output_delay -clock [get_clocks {ClkOut[7]}] -min -add_delay 1.000 [get_ports {DataOut[7]}]
set_output_delay -clock [get_clocks {ClkOut[7]}] -max -add_delay 1.000 [get_ports {DataOut[7]}]
set_output_delay -clock [get_clocks {ClkOut[8]}] -min -add_delay 1.000 [get_ports {DataOut[8]}]
set_output_delay -clock [get_clocks {ClkOut[8]}] -max -add_delay 1.000 [get_ports {DataOut[8]}]
set_output_delay -clock [get_clocks {ClkOut[9]}] -min -add_delay 1.000 [get_ports {DataOut[9]}]
set_output_delay -clock [get_clocks {ClkOut[9]}] -max -add_delay 1.000 [get_ports {DataOut[9]}]
set_output_delay -clock [get_clocks {ClkOut[10]}] -min -add_delay 1.000 [get_ports {DataOut[10]}]
set_output_delay -clock [get_clocks {ClkOut[10]}] -max -add_delay 1.000 [get_ports {DataOut[10]}]
set_output_delay -clock [get_clocks {ClkOut[11]}] -min -add_delay 1.000 [get_ports {DataOut[11]}]
set_output_delay -clock [get_clocks {ClkOut[11]}] -max -add_delay 1.000 [get_ports {DataOut[11]}]
set_output_delay -clock [get_clocks {ClkOut[12]}] -min -add_delay 1.000 [get_ports {DataOut[12]}]
set_output_delay -clock [get_clocks {ClkOut[12]}] -max -add_delay 1.000 [get_ports {DataOut[12]}]
set_output_delay -clock [get_clocks {ClkOut[13]}] -min -add_delay 1.000 [get_ports {DataOut[13]}]
set_output_delay -clock [get_clocks {ClkOut[13]}] -max -add_delay 1.000 [get_ports {DataOut[13]}]
set_output_delay -clock [get_clocks {ClkOut[14]}] -min -add_delay 1.000 [get_ports {DataOut[14]}]
set_output_delay -clock [get_clocks {ClkOut[14]}] -max -add_delay 1.000 [get_ports {DataOut[14]}]
set_output_delay -clock [get_clocks {ClkOut[15]}] -min -add_delay 1.000 [get_ports {DataOut[15]}]
set_output_delay -clock [get_clocks {ClkOut[15]}] -max -add_delay 1.000 [get_ports {DataOut[15]}]



set_clock_groups -name Clocks -asynchronous -group [get_clocks {ClkIn[0]}] -group [get_clocks {ClkIn[1]}] -group [get_clocks {ClkIn[2]}] -group [get_clocks {ClkIn[3]}] -group [get_clocks {ClkIn[4]}] -group [get_clocks {ClkIn[5]}] -group [get_clocks {ClkIn[6]}] -group [get_clocks {ClkIn[7]}] -group [get_clocks {ClkIn[8]}] -group [get_clocks {ClkIn[9]}] -group [get_clocks {ClkIn[10]}] -group [get_clocks {ClkIn[11]}] -group [get_clocks {ClkIn[12]}] -group [get_clocks {ClkIn[13]}] -group [get_clocks {ClkIn[14]}] -group [get_clocks {ClkIn[15]}] -group [get_clocks {ClkIn[16]}] -group [get_clocks {ClkIn[17]}] -group [get_clocks {ClkIn[18]}] -group [get_clocks {ClkIn[19]}] -group [get_clocks {ClkIn[20]}] -group [get_clocks {ClkIn[21]}] -group [get_clocks {ClkIn[22]}] -group [get_clocks {ClkIn[23]}] -group [get_clocks Clk93]


set_property CONFIG_MODE SPIx1 [current_design]
set_property BITSTREAM.CONFIG.CONFIGRATE 12 [current_design]
set_property BITSTREAM.CONFIG.SPI_32BIT_ADDR YES [current_design]
set_property BITSTREAM.CONFIG.SPI_BUSWIDTH 1 [current_design]

set_property CONFIG_VOLTAGE 3.3 [current_design]
set_property CFGBVS VCCO [current_design]



